# FontHorizontalAlignment Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellStyle..::..FontHorizontalAlignment Property
TableCellStyle Class See Also
---
The horizontal alignment style of text font.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public HorizontalAlignmentStyle FontHorizontalAlignment { get; set; }
```

Visual Basic
---
```text
Public Property FontHorizontalAlignment As HorizontalAlignmentStyle
	Get
	Set
```

Visual C++
---
```text
public:
property HorizontalAlignmentStyle FontHorizontalAlignment {
	HorizontalAlignmentStyle get ();
	void set (HorizontalAlignmentStyle value);
}
```

# ### Field Value
Alignment style.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
TableCellStyle Class
Autodesk.Revit.DB Namespace